In [2]:
# Importando as bibliotecas necessárias para o tratamento e exibição dos dados.

import pandas as pd
import matplotlib.pyplot as plt

In [3]:
# Alterando o estilo das plotagens.

plt.style.use("ggplot")

In [4]:
# Upload do Arquivo

# from google.colab import files
# arq = files.Upload()

In [5]:
# Criando nosso DataFrame

df = pd.read_excel("C:\Programação\DIO\Formação Python Developer\Analise_de_Dados\Cusro_Python_Pandas_Digital_Innovation-master\datasets\AdventureWorks.xlsx")

In [6]:
# Visualizando as 5 primeiras linhas 

df.head()

,Data Venda,Data Envio,ID Loja,ID Produto,ID Cliente,No. Venda,Custo Unitário,Preço Unitário,Quantidade,Valor Desconto,Valor Venda,Produto,Fabricante,Marca,Classe,Cor
0,2008-05-09,2008-05-29,199,384,18839,200805093CS607,348.58,758.0,6,0.0,4548.0,Adventure Works Laptop15.4W M1548 Red,Adventure Works,Adventure Works,Regular,Red
1,2008-05-12,2008-05-17,306,384,19051,200805123CS567,348.58,758.0,6,0.0,4548.0,Adventure Works Laptop15.4W M1548 Red,Adventure Works,Adventure Works,Regular,Red
2,2008-05-14,2008-05-20,306,384,19052,200805143CS576,348.58,758.0,6,0.0,4548.0,Adventure Works Laptop15.4W M1548 Red,Adventure Works,Adventure Works,Regular,Red
3,2008-05-21,2008-05-27,306,384,19052,200805213CS576,348.58,758.0,6,0.0,4548.0,Adventure Works Laptop15.4W M1548 Red,Adventure Works,Adventure Works,Regular,Red
4,2008-06-20,2008-06-27,306,384,19053,200806203CS586,348.58,758.0,6,0.0,4548.0,Adventure Works Laptop15.4W M1548 Red,Adventure Works,Adventure Works,Regular,Red

In [7]:
# Verificando Qtde de Linhas e Colunas

df.shape

(904, 16)

In [8]:
# Verificando os tipos de dados

df.dtypes

Data Venda        datetime64[ns]
Data Envio        datetime64[ns]
ID Loja                    int64
ID Produto                 int64
ID Cliente                 int64
No. Venda                 object
Custo Unitário           float64
Preço Unitário           float64
Quantidade                 int64
Valor Desconto           float64
Valor Venda              float64
Produto                   object
Fabricante                object
Marca                     object
Classe                    object
Cor                       object
dtype: object

In [ ]:
# Informações mais detalhadas do DF

df.info

In [11]:
# Qual a receita Total?

df["Valor Venda"].sum()

5984606.1426

In [12]:
# Qual o custo Total ?  Criando a coluna de Custo, para depois realizar uma soma.

df["Custo"] = df["Custo Unitário"] * df["Quantidade"]

In [16]:
df.head(1)

,Data Venda,Data Envio,ID Loja,ID Produto,ID Cliente,No. Venda,Custo Unitário,Preço Unitário,Quantidade,Valor Desconto,Valor Venda,Produto,Fabricante,Marca,Classe,Cor,Custo
0,2008-05-09,2008-05-29,199,384,18839,200805093CS607,348.58,758.0,6,0.0,4548.0,Adventure Works Laptop15.4W M1548 Red,Adventure Works,Adventure Works,Regular,Red,2091.48

In [27]:
# Medida Custo Total: é a soma de toda a coluna criada anteriormente;

round(df["Custo"].sum(), 2)

2486783.05

In [30]:
#  Agora que temos a receita e o custo total, podemos achar o Lucro Total;
# Criar uma coluna de Lucro que será Receita - Custo:

df["Lucro"] = df["Valor Venda"] - df["Custo"]

df.head(1)

,Data Venda,Data Envio,ID Loja,ID Produto,ID Cliente,No. Venda,Custo Unitário,Preço Unitário,Quantidade,Valor Desconto,Valor Venda,Produto,Fabricante,Marca,Classe,Cor,Custo,Lucro
0,2008-05-09,2008-05-29,199,384,18839,200805093CS607,348.58,758.0,6,0.0,4548.0,Adventure Works Laptop15.4W M1548 Red,Adventure Works,Adventure Works,Regular,Red,2091.48,2456.52

In [32]:
# Medida Lucro Total:

round(df["Lucro"].sum(), 2)

3497823.09

In [35]:
# Criando uma coluna com total de dias para enviar  o produto:

df["Tempo_Envio"] = df["Data Envio"] - df["Data Venda"]

df.head(1)

,Data Venda,Data Envio,ID Loja,ID Produto,ID Cliente,No. Venda,Custo Unitário,Preço Unitário,Quantidade,Valor Desconto,Valor Venda,Produto,Fabricante,Marca,Classe,Cor,Custo,Lucro,Tempo_Envio
0,2008-05-09,2008-05-29,199,384,18839,200805093CS607,348.58,758.0,6,0.0,4548.0,Adventure Works Laptop15.4W M1548 Red,Adventure Works,Adventure Works,Regular,Red,2091.48,2456.52,20 days

In [37]:
# Repetindo o bloco de cima, porém com um comando deixando a coluna criada como tipo número inteiro, pois no momento está como string. 

df["Tempo_Envio"] = (df["Data Envio"] - df["Data Venda"]).dt.days

df.head(1)

,Data Venda,Data Envio,ID Loja,ID Produto,ID Cliente,No. Venda,Custo Unitário,Preço Unitário,Quantidade,Valor Desconto,Valor Venda,Produto,Fabricante,Marca,Classe,Cor,Custo,Lucro,Tempo_Envio
0,2008-05-09,2008-05-29,199,384,18839,200805093CS607,348.58,758.0,6,0.0,4548.0,Adventure Works Laptop15.4W M1548 Red,Adventure Works,Adventure Works,Regular,Red,2091.48,2456.52,20